tutorials/XiFluid/stratified/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0 35 0)
    (70 0 0)
    (70 35 0)
    (0 0 1)
    (0 35 1)
    (70 0 1)
    (70 35 1)
);

blocks
(
    hex (0 2 3 1 4 6 7 5) (70 35 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
        );
    }
    right
    {
        type symmetryPlane;
        faces
        (
            (2 3 7 6)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (1 5 7 3)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 2 6 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 7 6)
            (0 1 3 2)
        );
    }
);


// ************************************************************************* //
